ARMmbed/mbed-os/targets/TARGET_TOSHIBA/TARGET_TMPM4GR/device/TMPM4GR.h
/**
 *******************************************************************************
 * @file    TMPM4GR.h
 * @brief   CMSIS Cortex-M4 Core Peripheral Access Layer Header File for the
 *          TOSHIBA 'TMPM4GR' Device Series
 * @version V1.0.0
 *
 * DO NOT USE THIS SOFTWARE WITHOUT THE SOFTWARE LICENSE AGREEMENT.
 *
 * Copyright(C) Toshiba Electronic Device Solutions Corporation 2021
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *******************************************************************************
 */

/** @addtogroup TOSHIBA_TXZ_MICROCONTROLLER
  * @{
  */

/** @addtogroup TMPM4GR
  * @{
  */

#ifndef __TMPM4GR_H__
#define __TMPM4GR_H__

#ifdef __cplusplus
extern "C" {
#endif

/** @addtogroup Configuration_of_CMSIS
  * @{
  */

/** Interrupt Number Definition */
typedef enum IRQn {
    /******  Cortex-M4 Processor Exceptions Numbers ***************************************************************/
    NonMaskableInt_IRQn           = -14,       /*!< 2 Non Maskable Interrupt                                    */
    HardFault_IRQn                = -13,       /*!< 3 Cortex-M4 Hard Fault Interrupt                            */
    MemoryManagement_IRQn         = -12,       /*!< 4 Cortex-M4 Memory Management Interrupt                     */
    BusFault_IRQn                 = -11,       /*!< 5 Cortex-M4 Bus Fault Interrupt                             */
    UsageFault_IRQn               = -10,       /*!< 6 Cortex-M4 Usage Fault Interrupt                           */
    SVCall_IRQn                   = -5,        /*!< 11 Cortex-M4 SV Call Interrupt                              */
    DebugMonitor_IRQn             = -4,        /*!< 12 Cortex-M4 Debug Monitor Interrupt                        */
    PendSV_IRQn                   = -2,        /*!< 14 Cortex-M4 Pend SV Interrupt                              */
    SysTick_IRQn                  = -1,        /*!< 15 Cortex-M4 System Tick Interrupt                          */

    /******  TMPM4GR Specific Interrupt Numbers *******************************************************************/
    INT00_IRQn                    = 0,         /*!< Interrupt pin 00a/00b                                       */
    INT01_IRQn                    = 1,         /*!< Interrupt pin 01a/00b                                       */
    INT02_IRQn                    = 2,         /*!< Interrupt pin 02a/00b                                       */
    INT03_IRQn                    = 3,         /*!< Interrupt pin 03a/03b                                       */
    INT04_IRQn                    = 4,         /*!< Interrupt pin 04a/04b                                       */
    INT05_IRQn                    = 5,         /*!< Interrupt pin 05a/05b                                       */
    INT06_IRQn                    = 6,         /*!< Interrupt pin 06a/06b                                       */
    INT07_IRQn                    = 7,         /*!< Interrupt pin 07a/07b                                       */
    INT08_IRQn                    = 8,         /*!< Interrupt pin 08a/08b                                       */
    INT09_IRQn                    = 9,         /*!< Interrupt pin 09a/09b                                       */
    INT10_IRQn                    = 10,        /*!< Interrupt pin 10a/10b                                       */
    INT11_IRQn                    = 11,        /*!< Interrupt pin 11a/11b                                       */
    INT12_IRQn                    = 12,        /*!< Interrupt pin 12a/12b                                       */
    INT13_IRQn                    = 13,        /*!< Interrupt pin 13a/13b                                       */
    INT14_IRQn                    = 14,        /*!< Interrupt pin 14a/14b                                       */
    INT15_IRQn                    = 15,        /*!< Interrupt pin 15a/15b                                       */
    INTRTC_IRQn                   = 16,        /*!< Real time clock(XHz) interrupt                              */
    INTCEC0RX_IRQn                = 17,        /*!< CEC reception interrupt (channel 0)                         */
    INTCEC0TX_IRQn                = 18,        /*!< CEC transmission interrupt (channel 0)                      */
    INTISDA_IRQn                  = 19,        /*!< Interval Sensing Detector interrupt (Unit A)                */
    INTISDB_IRQn                  = 20,        /*!< Interval Sensing Detector interrupt (Unit B)                */
    INTISDC_IRQn                  = 21,        /*!< Interval Sensing Detector interrupt (Unit C)                */
    INTRMC0_IRQn                  = 22,        /*!< Remote control reception interrupt 0                        */
    INTRMC1_IRQn                  = 23,        /*!< Remote control reception interrupt 1                        */
    INTLTTMR0_IRQn                = 24,        /*!< Long Term Timer Interrupt(channel 0)                        */
    INTHDMAATC_IRQn               = 25,        /*!< HDMA complete of transfer(Unit A)                           */
    INTHDMAAERR_IRQn              = 26,        /*!< HDMA transfer error(Unit A)                                 */
    INTHDMABTC_IRQn               = 27,        /*!< HDMA end of transfer(Unit B)                                */
    INTHDMABERR_IRQn              = 28,        /*!< HDMA transfer error(Unit B)                                 */
    INTMDMAATC_IRQn               = 29,        /*!< MDMA complete of transfer(Unit A)                           */
    INTT32A00_A_CT_IRQn           = 30,        /*!< T32A00 TimerA all interrupt /TimerC match, overflow, and underflow*/
    INTT32A00_B_C01_CPC_IRQn      = 31,        /*!< T32A00 TimerB all interrupt /TimerC capture C0_C1, pulse count interrupt*/
    INTT32A01_A_CT_IRQn           = 32,        /*!< T32A01 TimerA all interrupt /TimerC match, overflow, and underflow*/
    INTT32A01_B_C01_CPC_IRQn      = 33,        /*!< T32A01 TimerB all interrupt /TimerC capture C0_C1, pulse count interrupt*/
    INTT32A02_A_CT_IRQn           = 34,        /*!< T32A02 TimerA all interrupt /TimerC match, overflow, and underflow*/
    INTT32A02_B_C01_CPC_IRQn      = 35,        /*!< T32A02 TimerB all interrupt /TimerC capture C0_C1, pulse count interrupt*/
    INTT32A03_A_CT_IRQn           = 36,        /*!< T32A03 TimerA all interrupt /TimerC match, overflow, and underflow*/
    INTT32A03_B_C01_CPC_IRQn      = 37,        /*!< T32A03 TimerB all interrupt /TimerC capture C0_C1, pulse count interrupt*/
    INTT32A04_A_CT_IRQn           = 38,        /*!< T32A04 TimerA all interrupt /TimerC match, overflow, and underflow*/
    INTT32A04_B_C01_CPC_IRQn      = 39,        /*!< T32A04 TimerB all interrupt /TimerC capture C0_C1, pulse count interrupt*/
    INTT32A05_A_CT_IRQn           = 40,        /*!< T32A05 TimerA all interrupt /TimerC match, overflow, and underflow*/
    INTT32A05_B_C01_CPC_IRQn      = 41,        /*!< T32A05 TimerB all interrupt /TimerC capture C0_C1, pulse count interrupt*/
    INTT32A06_A_CT_IRQn           = 42,        /*!< T32A06 TimerA all interrupt /TimerC match, overflow, and underflow*/
    INTT32A06_B_C01_CPC_IRQn      = 43,        /*!< T32A06 TimerB all interrupt /TimerC capture C0_C1, pulse count interrupt*/
    INTT32A07_A_CT_IRQn           = 44,        /*!< T32A07 TimerA all interrupt /TimerC match, overflow, and underflow*/
    INTT32A07_B_C01_CPC_IRQn      = 45,        /*!< T32A07 TimerB all interrupt /TimerC capture C0_C1, pulse count interrupt*/
    INTT32A08_A_CT_IRQn           = 46,        /*!< T32A08 TimerA all interrupt /TimerC match, overflow, and underflow*/
    INTT32A08_B_C01_CPC_IRQn      = 47,        /*!< T32A08 TimerB all interrupt /TimerC capture C0_C1, pulse count interrupt*/
    INTT32A09_A_CT_IRQn           = 48,        /*!< T32A09 TimerA all interrupt /TimerC match, overflow, and underflow*/
    INTT32A09_B_C01_CPC_IRQn      = 49,        /*!< T32A09 TimerB all interrupt /TimerC capture C0_C1, pulse count interrupt*/
    INTT32A10_A_CT_IRQn           = 50,        /*!< T32A10 TimerA all interrupt /TimerC match, overflow, and underflow*/
    INTT32A10_B_C01_CPC_IRQn      = 51,        /*!< T32A10 TimerB all interrupt /TimerC capture C0_C1, pulse count interrupt*/
    INTT32A11_A_CT_IRQn           = 52,        /*!< T32A11 TimerA all interrupt /TimerC match, overflow, and underflow*/
    INTT32A11_B_C01_CPC_IRQn      = 53,        /*!< T32A11 TimerB all interrupt /TimerC capture C0_C1, pulse count interrupt*/
    INTT32A12_A_CT_IRQn           = 54,        /*!< T32A12 TimerA all interrupt /TimerC match, overflow, and underflow*/
    INTT32A12_B_C01_CPC_IRQn      = 55,        /*!< T32A12 TimerB all interrupt /TimerC capture C0_C1, pulse count interrupt*/
    INTT32A13_A_CT_IRQn           = 56,        /*!< T32A13 TimerA all interrupt /TimerC match, overflow, and underflow*/
    INTT32A13_B_C01_CPC_IRQn      = 57,        /*!< T32A13 TimerB all interrupt /TimerC capture C0_C1, pulse count interrupt*/
    INTEMG0_IRQn                  = 58,        /*!< PMD0 EMG interrupt                                          */
    INTOVV0_IRQn                  = 59,        /*!< PMD0 OVV interrupt                                          */
    INTPWM0_IRQn                  = 60,        /*!< PMD0 interrupt                                              */
    INTT0RX_IRQn                  = 61,        /*!< TSPI/SIO reception (channel 0) interrupt                    */
    INTT0TX_IRQn                  = 62,        /*!< TSPI/SIO transmit (channel 0) interrupt                     */
    INTT0ERR_IRQn                 = 63,        /*!< TSPI/SIO error (channel 0) interrupt                        */
    INTT1RX_IRQn                  = 64,        /*!< TSPI/SIO reception (channel 1) interrupt                    */
    INTT1TX_IRQn                  = 65,        /*!< TSPI/SIO transmit (channel 1) interrupt                     */
    INTT1ERR_IRQn                 = 66,        /*!< TSPI/SIO error (channel 1) interrupt                        */
    INTT2RX_IRQn                  = 67,        /*!< TSPI/SIO reception (channel 2) interrupt                    */
    INTT2TX_IRQn                  = 68,        /*!< TSPI/SIO transmit (channel 2) interrupt                     */
    INTT2ERR_IRQn                 = 69,        /*!< TSPI/SIO error (channel 2) interrupt                        */
    INTT3RX_IRQn                  = 70,        /*!< TSPI/SIO reception (channel 3) interrupt                    */
    INTT3TX_IRQn                  = 71,        /*!< TSPI/SIO transmit (channel 3) interrupt                     */
    INTT3ERR_IRQn                 = 72,        /*!< TSPI/SIO error (channel 3) interrupt                        */
    INTT4RX_IRQn                  = 73,        /*!< TSPI/SIO reception (channel 4) interrupt                    */
    INTT4TX_IRQn                  = 74,        /*!< TSPI/SIO transmit (channel 4) interrupt                     */
    INTT4ERR_IRQn                 = 75,        /*!< TSPI/SIO error (channel 4) interrupt                        */
    INTT5RX_IRQn                  = 76,        /*!< TSPI/SIO reception (channel 5) interrupt                    */
    INTT5TX_IRQn                  = 77,        /*!< TSPI/SIO transmit (channel 5) interrupt                     */
    INTT5ERR_IRQn                 = 78,        /*!< TSPI/SIO error (channel 5) interrupt                        */
    INTT6RX_IRQn                  = 79,        /*!< TSPI/SIO reception (channel 6) interrupt                    */
    INTT6TX_IRQn                  = 80,        /*!< TSPI/SIO transmit (channel 6) interrupt                     */
    INTT6ERR_IRQn                 = 81,        /*!< TSPI/SIO error (channel 6) interrupt                        */
    INTT7RX_IRQn                  = 82,        /*!< TSPI/SIO reception (channel 7) interrupt                    */
    INTT7TX_IRQn                  = 83,        /*!< TSPI/SIO transmit (channel 7) interrupt                     */
    INTT7ERR_IRQn                 = 84,        /*!< TSPI/SIO error (channel 7) interrupt                        */
    INTT8RX_IRQn                  = 85,        /*!< TSPI/SIO reception (channel 8) interrupt                    */
    INTT8TX_IRQn                  = 86,        /*!< TSPI/SIO transmit (channel 8) interrupt                     */
    INTT8ERR_IRQn                 = 87,        /*!< TSPI/SIO error (channel 8) interrupt                        */
    INTSMI0_IRQn                  = 88,        /*!< Serial Memory Interface interrupt                           */
    INTUART0RX_IRQn               = 89,        /*!< UART reception (channel 0) interrupt                        */
    INTUART0TX_IRQn               = 90,        /*!< UART transmit (channel 0) interrupt                         */
    INTUART0ERR_IRQn              = 91,        /*!< UART error (channel 0) interrupt                            */
    INTUART1RX_IRQn               = 92,        /*!< UART reception (channel 1) interrupt                        */
    INTUART1TX_IRQn               = 93,        /*!< UART transmit (channel 1) interrupt                         */
    INTUART1ERR_IRQn              = 94,        /*!< UART error (channel 1) interrupt                            */
    INTUART2RX_IRQn               = 95,        /*!< UART reception (channel 2) interrupt                        */
    INTUART2TX_IRQn               = 96,        /*!< UART transmit (channel 2) interrupt                         */
    INTUART2ERR_IRQn              = 97,        /*!< UART error (channel 2) interrupt                            */
    INTUART3RX_IRQn               = 98,        /*!< UART reception (channel 3) interrupt                        */
    INTUART3TX_IRQn               = 99,        /*!< UART transmit (channel 3) interrupt                         */
    INTUART3ERR_IRQn              = 100,       /*!< UART error (channel 3) interrupt                            */
    INTUART4RX_IRQn               = 101,       /*!< UART reception (channel 4) interrupt                        */
    INTUART4TX_IRQn               = 102,       /*!< UART transmit (channel 4) interrupt                         */
    INTUART4ERR_IRQn              = 103,       /*!< UART error (channel 4) interrupt                            */
    INTUART5RX_IRQn               = 104,       /*!< UART reception (channel 5) interrupt                        */
    INTUART5TX_IRQn               = 105,       /*!< UART transmit (channel 5) interrupt                         */
    INTUART5ERR_IRQn              = 106,       /*!< UART error (channel 5) interrupt                            */
    INTFUART0_IRQn                = 107,       /*!< FUART interrupt(channel 0)                                  */
    INTFUART1_IRQn                = 108,       /*!< FUART interrupt(channel 1)                                  */
    INTI2C0NST_IRQn               = 109,       /*!< I2C0 interrupt / EI2C0 status interrupt                     */
    INTI2C0ATX_IRQn               = 110,       /*!< I2C0 arbitration lost detection interrupt / EI2C0 transmit buffer empty interrupt*/
    INTI2C0BRX_IRQn               = 111,       /*!< I2C0 bus free detection interrupt / EI2C0receive buffer empty interrupt*/
    INTI2C0NA_IRQn                = 112,       /*!< I2C0 NACK detection interrupt                               */
    INTI2C1NST_IRQn               = 113,       /*!< I2C1 interrupt / EI2C0 status interrupt                     */
    INTI2C1ATX_IRQn               = 114,       /*!< I2C1 arbitration lost detection interrupt / EI2C0 transmit buffer empty interrupt*/
    INTI2C1BRX_IRQn               = 115,       /*!< I2C1 bus free detection interrupt / EI2C0receive buffer empty interrupt*/
    INTI2C1NA_IRQn                = 116,       /*!< I2C1 NACK detection interrupt                               */
    INTI2C2NST_IRQn               = 117,       /*!< I2C2 interrupt / EI2C0 status interrupt                     */
    INTI2C2ATX_IRQn               = 118,       /*!< I2C2 arbitration lost detection interrupt / EI2C0 transmit buffer empty interrupt*/
    INTI2C2BRX_IRQn               = 119,       /*!< I2C2 bus free detection interrupt / EI2C0receive buffer empty interrupt*/
    INTI2C2NA_IRQn                = 120,       /*!< I2C2 NACK detection interrupt                               */
    INTI2C3NST_IRQn               = 121,       /*!< I2C3 interrupt / EI2C0 status interrupt                     */
    INTI2C3ATX_IRQn               = 122,       /*!< I2C3 arbitration lost detection interrupt / EI2C0 transmit buffer empty interrupt*/
    INTI2C3BRX_IRQn               = 123,       /*!< I2C3 bus free detection interrupt / EI2C0receive buffer empty interrupt*/
    INTI2C3NA_IRQn                = 124,       /*!< I2C3 NACK detection interrupt                               */
    INTI2C4NST_IRQn               = 125,       /*!< I2C4 interrupt / EI2C0 status interrupt                     */
    INTI2C4ATX_IRQn               = 126,       /*!< I2C4 arbitration lost detection interrupt / EI2C0 transmit buffer empty interrupt*/
    INTI2C4BRX_IRQn               = 127,       /*!< I2C4 bus free detection interrupt / EI2C0receive buffer empty interrupt*/
    INTI2C4NA_IRQn                = 128,       /*!< I2C4 NACK detection interrupt                               */
    INTADACP0_IRQn                = 129,       /*!< ADC conversion monitoring function interrupt 0              */
    INTADACP1_IRQn                = 130,       /*!< ADC conversion monitoring function interrupt 1              */
    INTADATRG_IRQn                = 131,       /*!< ADC conversion triggered by General purpose is finished     */
    INTADASGL_IRQn                = 132,       /*!< ADC conversion triggered by Single program is finished      */
    INTADACNT_IRQn                = 133,       /*!< ADC conversion triggered by Continuity program is finished  */
    INTADAHP_IRQn                 = 134,       /*!< ADC high priority AD conversion interrupt                   */
    INTFLDRDY_IRQn                = 135,       /*!< Data FLASH Ready interrupt                                  */
    INTFLCRDY_IRQn                = 136,       /*!< Code FLASH Area0/1 Ready interrupt                          */
    INTMDMAABERR_IRQn             = 139,       /*!< MDMA bus error(Unit A) interrupt                            */
    INTMDMAADERR_IRQn             = 140,       /*!< MDMA descriptor error(Unit A) interrupt                     */
    INTI2S0SI_IRQn                = 141,       /*!< I2S ch0 SI transfer end interrupt                           */
    INTI2S0SIERR_IRQn             = 142,       /*!< I2S ch0 SI error interrupt                                  */
    INTI2S0SO_IRQn                = 143,       /*!< I2S ch0 SO transfer end interrupt                           */
    INTI2S0SOERR_IRQn             = 144,       /*!< I2S ch0 SO error interrupt                                  */
    INTI2S1SI_IRQn                = 145,       /*!< I2S ch1 SI transfer end interrupt                           */
    INTI2S1SIERR_IRQn             = 146,       /*!< I2S ch1 SI error interrupt                                  */
    INTI2S1SO_IRQn                = 147,       /*!< I2S ch1 SO transfer end interrupt                           */
    INTI2S1SOERR_IRQn             = 148,       /*!< I2S ch1 SO error interrupt                                  */
    INTFIR0_IRQn                  = 149,       /*!< FIR ch0 interrupt                                           */
    INTTSSI0RX_IRQn               = 150,       /*!< TSSI ch0 receive interrupt                                  */
    INTTSSI0TX_IRQn               = 151,       /*!< TSSI ch0 transmission interrupt                             */
    INTTSSI0ERR_IRQn              = 152,       /*!< TSSI ch0 error interrupt                                    */
    INTTSSI1RX_IRQn               = 153,       /*!< TSSI ch1 receive interrupt                                  */
    INTTSSI1TX_IRQn               = 154,       /*!< TSSI ch1 transmission interrupt                             */
    INTTSSI1ERR_IRQn              = 155,       /*!< TSSI ch1 error interrupt                                    */
    INTT32A14_A_IRQn              = 168,       /*!< T32A14 TimerA all interrupt                                 */
    INTT32A14_B_IRQn              = 169,       /*!< T32A14 TimerB all interrupt                                 */
    INTT32A14_CT_IRQn             = 170,       /*!< T32A14 TimerC match, overflow, and underflow Interrupt      */
    INTT32A15_A_IRQn              = 171,       /*!< T32A15 TimerA all interrupt                                 */
    INTT32A15_B_IRQn              = 172,       /*!< T32A15 TimerB all interrupt                                 */
    INTT32A15_C_IRQn              = 173,       /*!< T32A15 TimerC all interrupt                                 */
    INTMDMAADISR_IRQn             = 174        /*!< MDMAC unit A Descriptor interrupt                           */
} IRQn_Type;

